castagnoemanuele/STM32-smart-alarm/Smart-Alarm/Core/Src/main.c
    // 2. Reset hardware dell'RC522
    printf("Hardware reset...\n");
    HAL_GPIO_WritePin(RC522_Rst_GPIO_Port, RC522_Rst_Pin, GPIO_PIN_RESET);
    HAL_Delay(100);
    HAL_GPIO_WritePin(RC522_Rst_GPIO_Port, RC522_Rst_Pin, GPIO_PIN_SET);
    HAL_Delay(200);

    // 3. Test base SPI senza comunicare con l'RC522
    printf("Testing raw SPI with loopback...\n");
    uint8_t tx_test = 0xA5;
    uint8_t rx_test = 0;

    HAL_GPIO_WritePin(RC522_CS_GPIO_Port, RC522_CS_Pin, GPIO_PIN_SET); // Disattiva CS
    HAL_SPI_TransmitReceive(&hspi3, &tx_test, &rx_test, 1, 100);
    printf("  Loopback test: sent 0x%02X, received 0x%02X\n", tx_test, rx_test);

    // 4. Test comunicazione base con l'RC522
    printf("Testing basic read of VERSION register...\n");

    // Abbassa CS
    HAL_GPIO_WritePin(RC522_CS_GPIO_Port, RC522_CS_Pin, GPIO_PIN_RESET);
    HAL_Delay(5);

    // Invia comando di lettura del registro Version
    uint8_t addr_cmd = ((0x37 << 1) & 0x7E) | 0x80; // VersionReg + bit di lettura
    uint8_t dummy = 0x00;
    uint8_t rx_addr = 0;
    uint8_t rx_data = 0;

    printf("  Sending command 0x%02X\n", addr_cmd);
    if (HAL_SPI_TransmitReceive(&hspi3, &addr_cmd, &rx_addr, 1, 100) != HAL_OK) {
        printf("  SPI transmit error\n");
    }

    printf("  Sending dummy byte for data\n");
    if (HAL_SPI_TransmitReceive(&hspi3, &dummy, &rx_data, 1, 100) != HAL_OK) {
        printf("  SPI receive error\n");
    }

    // Alza CS
    HAL_GPIO_WritePin(RC522_CS_GPIO_Port, RC522_CS_Pin, GPIO_PIN_SET);

    printf("  Raw version register value: 0x%02X\n", rx_data);
    printf("*** END OF SPI TEST ***\n\n");
}

int ScanI2CDevices(void) {
	const char StartMSG[] = "Starting I2C scan...\r\n";
	const char EndMSG[] = "I2C scan complete.\r\n";
	const uint8_t Space[] = " ";
	char Buffer[32];

	uint8_t i, ret;
	char buffer[16];
	int found = 0;

	ssd1306_Fill(Black);
	ssd1306_SetCursor(0, 0);
	ssd1306_WriteString("I2C Scan:", Font_7x10, White);
	ssd1306_UpdateScreen();

	HAL_Delay(500);

	printf("%s", StartMSG);

	for (i = 1; i < 128; i++) {
		ret = HAL_I2C_IsDeviceReady(&hi2c1, (uint16_t) (i << 1), 3, 5);
		if (ret == HAL_OK) {
			sprintf(Buffer, "0x%X", i);
			HAL_UART_Transmit(&huart2, Buffer, sizeof(Buffer), 10000);

			sprintf(buffer, "Found: 0x%02X", i);
			ssd1306_SetCursor(0, 16 + found * 10);
			ssd1306_WriteString(buffer, Font_6x8, White);
			ssd1306_UpdateScreen();

			HAL_Delay(300);
			found++;
			if (found > 4)
				break;
		} else {
			HAL_UART_Transmit(&huart2, Space, sizeof(Space), 10000);
		}
	}

	HAL_UART_Transmit(&huart2, EndMSG, sizeof(EndMSG), 10000);
	return found;
}


void HandlePIRMotion(void) {
	static uint32_t last_pir_time = 0;
	static uint8_t pir_triggered = 0;

	// Read the current status of the PIR sensor
	uint8_t current_pir_state = HAL_GPIO_ReadPin(PIR_PORT, PIR_PIN);

	// If the sensor is active and the system is armed
	if (current_pir_state == GPIO_PIN_SET && pincodeState.system_armed) {
		// PIR Sensor Debounce
		if ((HAL_GetTick() - last_pir_time) > REED_DEBOUNCE_MS) {
			pir_triggered = 1;
			last_pir_time = HAL_GetTick();
			printf("Movement detected! Alarm activated.\r\n");
		}
	}

	// If motion was detected
	if (pir_triggered && !pincodeState.message_sent) {
		pir_triggered = 0;
		pincodeState.message_sent = true;  // Set to true after submit
		uint8_t send_byte = '2'; // Command to signal movement
		HAL_StatusTypeDef tx_status = HAL_I2C_Master_Transmit(&hi2c1,
				(I2C_ADDR << 1), &send_byte, 1, HAL_MAX_DELAY);
		TriggerAlarm();
	}
}

void HAL_TIM_PWM_PulseFinishedCallback(TIM_HandleTypeDef *htim) {
	if (htim->Instance == TIM2) {
		printf("DMA transfer completed for TIM2_CH1.\n");
	}
}

// Reset e inizializzazione SPI dedicata per RFID
void RFID_HardwareInit(void) {
    // Configura SPI3 con impostazioni molto conservative
    hspi3.Init.Mode = SPI_MODE_MASTER;
    hspi3.Init.Direction = SPI_DIRECTION_2LINES;
    hspi3.Init.DataSize = SPI_DATASIZE_8BIT;
    hspi3.Init.CLKPolarity = SPI_POLARITY_LOW;
    hspi3.Init.CLKPhase = SPI_PHASE_1EDGE;
    hspi3.Init.NSS = SPI_NSS_SOFT;
    hspi3.Init.BaudRatePrescaler = SPI_BAUDRATEPRESCALER_256; // Più lento possibile
    hspi3.Init.FirstBit = SPI_FIRSTBIT_MSB;
    hspi3.Init.TIMode = SPI_TIMODE_DISABLE;
    hspi3.Init.CRCCalculation = SPI_CRCCALCULATION_DISABLE;
    if (HAL_SPI_Init(&hspi3) != HAL_OK) {
        Error_Handler();
    }

    // Imposta alto il CS
    HAL_GPIO_WritePin(RC522_CS_GPIO_Port, RC522_CS_Pin, GPIO_PIN_SET);

    // Esegui un reset hardware completo
    printf("Eseguo reset hardware completo RFID...\n");
    HAL_GPIO_WritePin(RC522_Rst_GPIO_Port, RC522_Rst_Pin, GPIO_PIN_RESET);
    HAL_Delay(200); // Reset più lungo
    HAL_GPIO_WritePin(RC522_Rst_GPIO_Port, RC522_Rst_Pin, GPIO_PIN_SET);
    HAL_Delay(200); // Attesa più lunga

    // Verifica che i pin SPI funzionino
    printf("Test pin SPI:\n");

    // Abbassa e alza il CS per verificare che funzioni
    printf("Test CS...\n");
    HAL_GPIO_WritePin(RC522_CS_GPIO_Port, RC522_CS_Pin, GPIO_PIN_RESET);
    HAL_Delay(10);
    HAL_GPIO_WritePin(RC522_CS_GPIO_Port, RC522_CS_Pin, GPIO_PIN_SET);
    HAL_Delay(10);

    // Prova ad inviare un byte per verificare che MOSI e SCK funzionino
    printf("Test invio dati...\n");
    uint8_t test_data = 0xAA;
    HAL_GPIO_WritePin(RC522_CS_GPIO_Port, RC522_CS_Pin, GPIO_PIN_RESET);
    HAL_SPI_Transmit(&hspi3, &test_data, 1, 100);
    HAL_GPIO_WritePin(RC522_CS_GPIO_Port, RC522_CS_Pin, GPIO_PIN_SET);

    printf("Hardware RFID inizializzato\n");
}

void Test_SPI3_I2C1(void) {
    printf("Testing SPI3 and I2C1 together...\n");

    // Test I2C1
    uint8_t i2c_data[] = {0x01, 0x02, 0x03};
    HAL_StatusTypeDef i2c_status = HAL_I2C_Master_Transmit(&hi2c1, 0x50 << 1, i2c_data, sizeof(i2c_data), 100);
    if (i2c_status == HAL_OK) {
        printf("I2C1 test passed\n");
    } else {
        printf("I2C1 test failed\n");
    }

    // Test SPI3
    uint8_t spi_tx_data = 0xAA;
    uint8_t spi_rx_data = 0x00;
    HAL_GPIO_WritePin(RC522_CS_GPIO_Port, RC522_CS_Pin, GPIO_PIN_RESET);
    HAL_StatusTypeDef spi_status = HAL_SPI_TransmitReceive(&hspi3, &spi_tx_data, &spi_rx_data, 1, 100);
    HAL_GPIO_WritePin(RC522_CS_GPIO_Port, RC522_CS_Pin, GPIO_PIN_SET);
    if (spi_status == HAL_OK) {
        printf("SPI3 test passed, received: 0x%02X\n", spi_rx_data);
    } else {
        printf("SPI3 test failed\n");
    }
}

/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
	/* User can add his own implementation to report the HAL error return state */
	__disable_irq();
	while (1) {
	}
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
    /* User can add his own implementation to report the file name and line number,
       ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
